app/Category.php

    public static function boot()
    {
        parent::boot();
        static::deleting(function ($category) {

            //Las categorias hijas y los documentos de esta se iran a la categoria descategorizadas
            $category->documents->each->update([
                'category_id' => '2'
            ]);

            $category->children->each->update([
                'category_parent_id' => '2'
            ]);



        });
---
select * from `categories` where `categories`.`category_parent_id` = '4' and `categories`.`category_parent_id` is not null and `categories`.`deleted_at` is null
select * from `documents` where `documents`.`category_id` = '4' and `documents`.`category_id` is not null and `documents`.`deleted_at` is null