app/Document.php

    public static function boot()
    {
        parent::boot();
        static::deleting(function ($document) {
            $document->tags()->detach();
            $document->likes->each->delete();
---
delete from `document_tags` where `document_id` = '251'
select * from `likes` where `likes`.`document_id` = '251' and `likes`.`document_id` is not null

    public function syncTags($tags)
    {
        $tagIds = collect($tags)->map(function ($tag){
            return Tag::find($tag) ? $tag : Tag::create(['name' => $tag])->id;
---
select * from `tags` where `tags`.`id` = '1' limit 1