app/User.php

    public static function boot()
    {
        parent::boot();
        static::deleting(function ($user) {


            $mimessages = Message::where('from','=',$user->id)->get();
            $mimessages1 = Message::where('to','=',$user->id)->get();
            $mimessages->each->delete();
            $mimessages1->each->delete();

            $user->categories->each->update([
                'user_id' => '2'
            ]);

            $conservatepremium = Document::where('user_id','=',$user->id)->where('premium','=','1')->get();
            $conservatepremium->each->update([
                'user_id' => '2'
            ]);

            $deletepublic = Document::where('user_id','=',$user->id)->where('premium','=','0')->get();
---
select * from `messages` where `from` = '192' and `messages`.`deleted_at` is null
select * from `messages` where `to` = '192' and `messages`.`deleted_at` is null
select * from `categories` where `categories`.`user_id` = '192' and `categories`.`user_id` is not null and `categories`.`deleted_at` is null
select * from `documents` where `user_id` = '192' and `premium` = '1' and `documents`.`deleted_at` is null
select * from `documents` where `user_id` = '192' and `premium` = '0' and `documents`.`deleted_at` is null