app/Http/Controllers/CategoriesController.php

    public function store(Request $request)
    {

        $this->validate($request, [
            'name' => 'required|min:3',
            'description' => 'required |min:3',
            'category_parent_id' => 'required'
        ]);

        $category = new Category($request->all());
---
select * from `categories` where `categories`.`deleted_at` is null