app/Http/Controllers/DocCloudController.php

select * from `categories` where `categories`.`deleted_at` is null
---
    public function tree($idcat)
    {
        $all = Category::all();

select * from `users` where `users`.`id` = '1' and `users`.`deleted_at` is null limit 1
---
    public function getinfoheader()
    {
        $iduser = Auth::id();
        $user = User::find($iduser);