app/Http/Controllers/DocumentsController.php

    public function index()
    {
        $documents = Document::all()->where('user_id', '=', Auth::id());

        $user = User::find(Auth::id());
---
select * from `users` where `users`.`id` = '1' and `users`.`deleted_at` is null limit 1