app/Http/Controllers/HomeController.php

select * from `documents` where `storage` is not null and `documents`.`deleted_at` is null order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `documents` where `storage` is not null and `documents`.`deleted_at` is null
---
    public function index()
    {
            $user = auth()->user();
            $documentstimeline = Document::whereNotNull('category_id')->whereNotNull('storage')->orderBy('created_at','desc')->paginate(15);