app/Http/Controllers/MessagesController.php

    public function index()
    {
        $user = Auth::id();
        $messages = Message::where('to','=',$user)->orderBy('created_at','desc')->paginate(10);
---
select * from `messages` where `to` = '1' and `messages`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `messages` where `to` = '1' and `messages`.`deleted_at` is null

    public function out()
    {
        $user = Auth::id();
        $messages = Message::where('from','=',$user)->orderBy('created_at','desc')->paginate(10);
---
select * from `messages` where `from` = '1' and `messages`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `messages` where `from` = '1' and `messages`.`deleted_at` is null

    public function read($idmsg ,$idfrom)
    {
        $msg = Message::find($idmsg);
        $user = Auth::id();
        $messages =  DB::select( DB::raw("select * from messages as m where  m.to in ($idfrom,$user) and m.from in($idfrom,$user) order by created_at desc"));

        $ids = array();
        foreach($messages as $idmsg){
            $ids[] = $idmsg->id;
        }

        $mes = Message::whereIn('id', $ids)->orderBy('id','desc')->paginate(5);
---
select * from `messages` where `messages`.`id` = '382' and `messages`.`deleted_at` is null limit 1
select * from `messages` where `id` in ('382') and `messages`.`deleted_at` is null order by `id` desc limit 5 offset 0
select count(*) as aggregate from `messages` where `id` in ('382') and `messages`.`deleted_at` is null

    public function readed(Request $id)
    {
        $email = Message::find($id->id);
---
select * from `messages` where `messages`.`id` = '382' and `messages`.`deleted_at` is null limit 1

    public function getNews()
    {
        $user = Auth::id();

        $mesages = Message::with('user')->where('to','=',$user)->where('read','=','0')->orderBy('created_at','desc')->get();
---
select * from `messages` where `to` = '1' and `read` = '0' and `messages`.`deleted_at` is null order by `created_at` desc