app/Http/Controllers/MoneyController.php

    public function totals()
    {
        $iduser = Auth::id();
        $documents_user = Document::where('user_id', '=',$iduser)->get();
---
select * from `documents` where `user_id` = '1' and `documents`.`deleted_at` is null

    public function totalrevenue()
    {
        $iduser = Auth::id();
        $documents_user = Document::where('user_id', '=',$iduser)->get();
---
select * from `documents` where `user_id` = '1' and `documents`.`deleted_at` is null