app/Http/Controllers/SearchController.php

    public function getUsers(Request $users)
    {
        if(!empty($users->users)) {


            $usrs = User::where('name',  'like', '%' . $users->users . '%')->orWhere('lastname',  'like', '%' . $users->users . '%')->limit(15)->get();
---
select * from `users` where (`name` like '%p%' or `lastname` like '%p%') and `users`.`deleted_at` is null limit 15

    public function getDocuments(Request $documents)
    {
        if(!empty($documents->documents)) {

            $doc = Document::where('name', 'like', '%' . $documents->documents . '%')->orWhere('description',  'like', '%' . $documents->documents . '%')->limit(15)->with('extension')->get();
---
select * from `documents` where (`name` like '%t%' or `description` like '%t%') and `documents`.`deleted_at` is null limit 15
select * from `extensions` where `extensions`.`id` in ('2', '3', '4', '5', '6', '7', '8')

    public function getCategories(Request $categories)
    {
        if(!empty($categories->categories)) {

            $cat = Category::where('name', 'like', '%' . $categories->categories . '%')->orWhere('description',  'like', '%' . $categories->categories . '%')->limit(15)->get();
---
select * from `categories` where (`name` like '%r%' or `description` like '%r%') and `categories`.`deleted_at` is null limit 15