app/Http/Controllers/Admin/AdminController.php

select * from `users` where `id` in ('2', '1', '172', '182', '94', '47', '121', '127', '162', '6', '111', '32', '106', '103', '102', '83', '115', '112', '151', '152') and `users`.`deleted_at` is null order by `created_at` desc
---
    public function index()
    {
        if (auth()->user()->hasrole('SuperAdmin','Admin')) {

            $lastmembersids =  DB::select( DB::raw("SELECT id as id FROM users where date(created_at)>date(date_sub(NOW(), INTERVAL 30 DAY))  ORDER BY created_at DESC LIMIT 30"));
            $ids = array();
            foreach($lastmembersids as $id){
                $ids[] = $id->id;
            }

            $lastmembers = User::whereIn('id', $ids)->orderBy('created_at','desc')->get();