app/Http/Controllers/Admin/CategoriesController.php

    public function index()
    {


        if (auth()->user()->hasrole('SuperAdmin','Admin')) {
            $categories = Category::whereNotNull('category_parent_id')->get();
---
select * from `categories` where `category_parent_id` is not null and `categories`.`deleted_at` is null

    public function getCategory(Request $name )
    {
        if (auth()->user()->hasrole('SuperAdmin','Admin')) {
            if (!empty($name->name)) {

            $childs = Category::where('name','like', '%'.$name->name.'%')->get();
---
select * from `categories` where `name` like '%cdd%' and `categories`.`deleted_at` is null

    public function show($id)
    {
        if (auth()->user()->hasrole('SuperAdmin','Admin')) {
            $category = Category::find($id);
---
select * from `categories` where `categories`.`id` = '3' and `categories`.`deleted_at` is null limit 1

    public function showTree()
    {
        if (auth()->user()->hasrole('SuperAdmin','Admin')) {
            $categories = Category::all();
---
select * from `categories` where `categories`.`deleted_at` is null

    public function edit($id)
    {
        if (auth()->user()->hasrole('SuperAdmin','Admin')) {
            $category = Category::find($id);
---
select * from `categories` where `categories`.`deleted_at` is null

    public function destroy($id)
    {
        if (auth()->user()->hasrole('SuperAdmin', 'Admin')) {
            $category = Category::find($id);

            if ($category->id === 1) {
                return redirect('/admin/category')->with('danger', 'La categoria raiz no es borrable');
            }





            $category->delete();
---
select * from `categories` where `categories`.`id` = '4' and `categories`.`deleted_at` is null limit 1
update `categories` set `deleted_at` = '2018-06-18 18:34:39', `updated_at` = '2018-06-18 18:34:39' where `id` = '4'