app/Http/Controllers/Admin/DocumentsController.php

select * from `documents` where `documents`.`deleted_at` is null
---
    public function index()
    {
        if (auth()->user()->hasrole('SuperAdmin','Admin')) {

           $documents = Document::all();

select * from `tags`
---
    public function edit(Document $document)
    {

        if (auth()->user()->hasrole('SuperAdmin','Admin')) {

            return view('admin.documents.edit', [
                'document'=> $document,
               // 'categories' => Category::all(),
                'tags' => Tag::all()

update `documents` set `price` = '23.65', `updated_at` = '2018-06-18 18:33:02' where `id` = '1'
---
    public function update(Request $request, Document $document)
    {
        if (auth()->user()->hasrole('SuperAdmin','Admin')) {

            $this->validate($request, [
                'name' => 'required|min:3',
                'description' => 'required|min:6',
                'category_id' => 'required',
                'premium' => 'required'

                 ]);
            $document->syncTags($request->tags);

                if($request->premium != 1){
                    $request->price = null;
                    $document->price = $request->price;
                    $document->save();

                }else {

                    $request->price = round(floatval($request->price),2);
                    $document->price = $request->price;
                    $document->save();

select * from `documents` where `documents`.`id` = '251' and `documents`.`deleted_at` is null limit 1
update `documents` set `deleted_at` = '2018-06-18 18:31:04', `updated_at` = '2018-06-18 18:31:04' where `id` = '251'
---
    public function destroy($id)
    {

        $document = Document::find($id);
        if($document->premium === 1){

            return redirect()->route('admin.documents.index')->with('danger', 'No puedes borrar un documento monetizado');
        }else{

            $document->delete();