app/Http/Controllers/Admin/MessagesController.php

    public function index()
    {
        $user = Auth::id();
        $messages = Message::where('to','=',$user)->orderBy('created_at','desc')->get();
---
select * from `messages` where `to` = '1' and `messages`.`deleted_at` is null order by `created_at` desc

    public function read($idmsg ,$idfrom)
    {
        $msg = Message::find($idmsg);
        $user = Auth::id();
        $messages =  DB::select( DB::raw("select * from messages as m where  m.to in ($idfrom,$user) and m.from in($idfrom,$user) order by created_at desc"));

        $ids = array();
        foreach($messages as $idmsg){
            $ids[] = $idmsg->id;
        }

        $mes = Message::whereIn('id', $ids)->orderBy('id','desc')->paginate(5);
---
select * from `messages` where `messages`.`id` = '599' and `messages`.`deleted_at` is null limit 1
select * from `messages` where `id` in ('599', '29') and `messages`.`deleted_at` is null order by `id` desc limit 5 offset 0
select count(*) as aggregate from `messages` where `id` in ('599', '29') and `messages`.`deleted_at` is null

    public function readed(Request $id)
    {
        $email = Message::find($id->id);
        $user = Auth::id();


        $idto = $email->from;
        $messages =  DB::select( DB::raw("select id from messages as m where  m.to in ($idto,$user) and m.from in($idto,$user) and m.to = $user "));
        $ids = array();
        foreach($messages as $idmsg){
            $ids[] = $idmsg->id;
        }
        if($user === $email->to){

            Message::whereIn('id', $ids)->update(['read' => 1]);
---
select * from `messages` where `messages`.`id` = '599' and `messages`.`deleted_at` is null limit 1
update `messages` set `read` = '1', `updated_at` = '2018-06-18 17:16:58' where `id` in ('599') and `messages`.`deleted_at` is null