app/Http/Controllers/Admin/PaymentsController.php

    public function index()
    {
        if (auth()->user()->hasrole('SuperAdmin','Admin')) {

            $payments = Pay::paginate(10);
---
select * from `pays` where `pays`.`deleted_at` is null limit 10 offset 0
select count(*) as aggregate from `pays` where `pays`.`deleted_at` is null

    public function searchPays(Request $request)
    {
        if (auth()->user()->hasrole('SuperAdmin','Admin')) {
            $this->validate($request, [
                'search' => 'required',
                'termn' => 'numeric',
            ]);

            if($request->termn == 1){
                $paymentsearch = Pay::where('id','=',$request->search)->paginate();
---
select * from `pays` where `id` = '345' and `pays`.`deleted_at` is null limit 15 offset 0
select count(*) as aggregate from `pays` where `id` = '345' and `pays`.`deleted_at` is null