app/Http/Controllers/Admin/UsersController.php

select * from `users` where `users`.`deleted_at` is null
---
    public function index()
    {
        if (auth()->user()->hasrole('SuperAdmin')) {

        $users = User::all();

select * from `roles`
---
    public function create()
    {
        if (auth()->user()->hasrole('SuperAdmin')) {

            $roles = Role::all();

insert into `users` (`name`, `lastname`, `email`, `password`, `updated_at`, `created_at`) values ('Test', 'Testing', 'testtt@gmail.com', 'y$FzeWnjqvc4cECSbSXnRSTemrxDsnwpYOWEaK1/FvRMKk.NYPVu/ha', '2018-06-18 18:29:58', '2018-06-18 18:29:58')
---
    public function store(Request $request)
    {
        if (auth()->user()->hasrole('SuperAdmin')) {


            $this->validate($request, [
                'name' => 'required|min:3',
                'lastname' => 'required|min:3',
                'password'=>'required|min:5',
                'email' => 'required|email',
                'role'  => 'required'
            ]);

            $usuario = new User;
            $rol = Role::findById($request->role);
           // dd($rol->name);
            $usuario->name = $request->name;
            $usuario->lastname = $request->lastname;
            $usuario->email = $request->email;
            $usuario->password = bcrypt($request->password);

            $usuario->save();

select * from `users` where `users`.`id` = '192' and `users`.`deleted_at` is null limit 1
update `users` set `deleted_at` = '2018-06-18 18:30:27', `updated_at` = '2018-06-18 18:30:27' where `id` = '192'
---
    public function destroy($id)
    {
        if (auth()->user()->hasrole('SuperAdmin')) {

            $user = User::find($id);
            $user->delete();